INSERT INTO Teacher (TeacherID, Name) VALUES
(1, 'מרים כהן'),
(2, 'רחל לוי'),
(3, 'שרה ישראלי'),
(4, 'חנה אברהם'),
(5, 'לאה גולדברג'),
(6, 'רבקה יצחקי'),
(7, 'אסתר המלכה'),
(8, 'דינה ששון'),
(9, 'ציפורה משה'),
(10, 'אביגיל דוד');

INSERT INTO "Group" (GroupID, GroupName, TeacherID) VALUES
(101, 'קבוצת דובונים', 1),
(102, 'קבוצת פרפרים', 2),
(103, 'קבוצת אריות', 3),
(104, 'קבוצת צביים', 4),
(105, 'קבוצת נשרים', 5),
(106, 'קבוצת דולפינים', 6),
(107, 'קבוצת סנאים', 7),
(108, 'קבוצת שועלים', 8),
(109, 'קבוצת ארנבים', 9),
(110, 'קבוצת ינשופים', 10);

INSERT INTO Child (ChildID, Age, GroupID) VALUES
(1, 3, 101),
(2, 4, 102),
(3, 5, 103),
(4, 3, 104),
(5, 4, 105),
(6, 5, 106),
(7, 3, 107),
(8, 4, 108),
(9, 5, 109),
(10, 6, 110);

commit;